// Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

Console.WriteLine("Введите положительное число для показа всех чётных чисел от 1 до выбранного числа");
int a = Convert.ToInt32(Console.ReadLine());

for ()