// Напишите программу для подсчета количества цифр в числе с помощью рекурсии

Console.WriteLine("Будет сгенерированно случайное число, для подсчёта цифр в нём");
int number = new Random.Next(0, 1000000);
Console.WriteLine($"Случайное число: {number}");

